/* 
    URL(统一资源定位符)
    -作用：通过URL可以访问到网络上的任何资源！
    URL格式： 协议名://主机名[:端口号]/[路径名/.../文件名]


    TCP/IP协议
    - TCP 传输控制协议
    - IP IP协议

    - TCP/IP协议不仅仅是指TCP和IP两个协议，而是指一个由FTP、SMTP、TCP、UDP、IP等协议构成的协议簇
    - 作用：通过该协议可以让网络中的计算机彼此建立稳定的连接，便于数据能够稳定的传输

    IP地址:互联网中的每一台计算机都有且只有一个唯一的标识，就是ip地址，类似于人的身份证号！
    端口：端口的作用是为了区分计算机上不同的应用进程，每一个进程设置了独立的端口号，其作用就是保证数据不会混乱！

    重点：ip地址+端口号，通过这两者就可以访问到网络中任何一个服务器的应用服务！

    HTTP协议：超文本传输协议
    - 它是基于TCP协议的应用层传输协议，简单来说就是客户端和服务端进行数据传输和交互的一种规则
    - 客户端和服务器端双方都要遵守这个协议，才能保证数据传输可靠有效，才有友好的玩耍和交流

    HTTP报文组成部分：
        行 起始行
        头 请求头/响应头
        体 请求体/响应体


    






*/